[Killed] BlockStatement
lib/rocketchat-client.js:13:31
 const CHANNEL_NAME_PATTERN = /^[a-z0-9._-]+$/i;
 
 class ValidationError extends Error {
-  constructor(message, field) {
-    super(message);
-    this.name = 'ValidationError';
-    this.field = field;
-  }
+  constructor(message, field) {}
 }
 
killedBy: validateCredentials rejects empty username
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      63 |       super(message);

[Killed] BlockStatement
lib/rocketchat-client.js:21:38
 }
 
 class ApiError extends Error {
-  constructor(message, status, body) {
-    super(message);
-    this.name = 'ApiError';
-    this.status = status;
-    this.body = body;
-  }
+  constructor(message, status, body) {}
 }
 
killedBy: normalizeError wraps axios error with response into ApiError
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
lib/rocketchat-client.js:29:45
   }
 }
 
-function assertNonEmptyString(value, field) {
-  if (typeof value !== 'string') {
-    throw new ValidationError(`${field} must be a string`, field);
-  }
-  if (value.length === 0) {
-    throw new ValidationError(`${field} must not be empty`, field);
-  }
-}
+function assertNonEmptyString(value, field) {}
 
 function validateCredentials(username, password) {
killedBy: validateCredentials rejects empty username
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
lib/rocketchat-client.js:30:34
 }
 
 function assertNonEmptyString(value, field) {
-  if (typeof value !== 'string') {
-    throw new ValidationError(`${field} must be a string`, field);
-  }
+  if (typeof value !== 'string') {}
   if (value.length === 0) {
     throw new ValidationError(`${field} must not be empty`, field);
killedBy: validateCredentials rejects non-string username
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
lib/rocketchat-client.js:30:7
 }
 
 function assertNonEmptyString(value, field) {
-  if (typeof value !== 'string') {
+  if (false) {
     throw new ValidationError(`${field} must be a string`, field);
   }
killedBy: validateCredentials rejects non-string username
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
lib/rocketchat-client.js:33:7
   if (typeof value !== 'string') {
     throw new ValidationError(`${field} must be a string`, field);
   }
-  if (value.length === 0) {
+  if (false) {
     throw new ValidationError(`${field} must not be empty`, field);
   }
killedBy: validateCredentials rejects empty username
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] EqualityOperator
lib/rocketchat-client.js:33:7
   if (typeof value !== 'string') {
     throw new ValidationError(`${field} must be a string`, field);
   }
-  if (value.length === 0) {
+  if (value.length !== 0) {
     throw new ValidationError(`${field} must not be empty`, field);
   }
killedBy: validateCredentials accepts valid username and password
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "username must not be empty"

       98 |       } else {
       99 |         stryCov_9fa48("19");
    > 100 |         throw new ValidationError(stryMutAct_9fa48("20") ? `` : (stryCov_9fa48("20"), `${field} must not be empty`), field);

[Killed] BlockStatement
lib/rocketchat-client.js:38:50
   }
 }
 
-function validateCredentials(username, password) {
-  assertNonEmptyString(username, 'username');
-  assertNonEmptyString(password, 'password');
-  if (username.length > MAX_USERNAME_LENGTH) {
-    throw new ValidationError('username too long', 'username');
-  }
-  if (password.length < MIN_PASSWORD_LENGTH) {
-    throw new ValidationError('password too short', 'password');
-  }
-}
+function validateCredentials(username, password) {}
 
 function validateChannelName(name) {
killedBy: validateCredentials rejects empty username
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
lib/rocketchat-client.js:41:7
 function validateCredentials(username, password) {
   assertNonEmptyString(username, 'username');
   assertNonEmptyString(password, 'password');
-  if (username.length > MAX_USERNAME_LENGTH) {
+  if (false) {
     throw new ValidationError('username too long', 'username');
   }
killedBy: validateCredentials rejects username longer than MAX_USERNAME_LENGTH
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /username too long/

Received function did not throw

[Killed] EqualityOperator
lib/rocketchat-client.js:41:7
 function validateCredentials(username, password) {
   assertNonEmptyString(username, 'username');
   assertNonEmptyString(password, 'password');
-  if (username.length > MAX_USERNAME_LENGTH) {
+  if (username.length <= MAX_USERNAME_LENGTH) {
     throw new ValidationError('username too long', 'username');
   }
killedBy: validateCredentials accepts valid username and password
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "username too long"

      115 |       } else {
      116 |         stryCov_9fa48("28");
    > 117 |         throw new ValidationError(stryMutAct_9fa48("29") ? "" : (stryCov_9fa48("29"), 'username too long'), stryMutAct_9fa48("30") ? "" : (stryCov_9fa48("30"), 'username'));

[Killed] EqualityOperator
lib/rocketchat-client.js:44:7
   if (username.length > MAX_USERNAME_LENGTH) {
     throw new ValidationError('username too long', 'username');
   }
-  if (password.length < MIN_PASSWORD_LENGTH) {
+  if (password.length >= MIN_PASSWORD_LENGTH) {
     throw new ValidationError('password too short', 'password');
   }
killedBy: validateCredentials accepts valid username and password
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "password too short"

      123 |       } else {
      124 |         stryCov_9fa48("35");
    > 125 |         throw new ValidationError(stryMutAct_9fa48("36") ? "" : (stryCov_9fa48("36"), 'password too short'), stryMutAct_9fa48("37") ? "" : (stryCov_9fa48("37"), 'password'));

[Killed] ConditionalExpression
lib/rocketchat-client.js:44:7
   if (username.length > MAX_USERNAME_LENGTH) {
     throw new ValidationError('username too long', 'username');
   }
-  if (password.length < MIN_PASSWORD_LENGTH) {
+  if (true) {
     throw new ValidationError('password too short', 'password');
   }
killedBy: validateCredentials accepts valid username and password
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "password too short"

      123 |       } else {
      124 |         stryCov_9fa48("35");
    > 125 |         throw new ValidationError(stryMutAct_9fa48("36") ? "" : (stryCov_9fa48("36"), 'password too short'), stryMutAct_9fa48("37") ? "" : (stryCov_9fa48("37"), 'password'));

[Killed] BlockStatement
lib/rocketchat-client.js:49:36
   }
 }
 
-function validateChannelName(name) {
-  assertNonEmptyString(name, 'name');
-  if (name.length > MAX_CHANNEL_NAME_LENGTH) {
-    throw new ValidationError('channel name too long', 'name');
-  }
-  if (!CHANNEL_NAME_PATTERN.test(name)) {
-    throw new ValidationError('channel name contains invalid characters', 'name');
-  }
-}
+function validateChannelName(name) {}
 
 function validateMessage(roomId, text) {
killedBy: validateChannelName rejects empty name
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] EqualityOperator
lib/rocketchat-client.js:51:7
 
 function validateChannelName(name) {
   assertNonEmptyString(name, 'name');
-  if (name.length > MAX_CHANNEL_NAME_LENGTH) {
+  if (name.length <= MAX_CHANNEL_NAME_LENGTH) {
     throw new ValidationError('channel name too long', 'name');
   }
killedBy: validateChannelName accepts valid channel name
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "channel name too long"

      139 |       } else {
      140 |         stryCov_9fa48("44");
    > 141 |         throw new ValidationError(stryMutAct_9fa48("45") ? "" : (stryCov_9fa48("45"), 'channel name too long'), stryMutAct_9fa48("46") ? "" : (stryCov_9fa48("46"), 'name'));

[Killed] EqualityOperator
lib/rocketchat-client.js:51:7
 
 function validateChannelName(name) {
   assertNonEmptyString(name, 'name');
-  if (name.length > MAX_CHANNEL_NAME_LENGTH) {
+  if (name.length >= MAX_CHANNEL_NAME_LENGTH) {
     throw new ValidationError('channel name too long', 'name');
   }
killedBy: validateChannelName accepts name exactly MAX_CHANNEL_NAME_LENGTH
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "channel name too long"

      139 |       } else {
      140 |         stryCov_9fa48("44");
    > 141 |         throw new ValidationError(stryMutAct_9fa48("45") ? "" : (stryCov_9fa48("45"), 'channel name too long'), stryMutAct_9fa48("46") ? "" : (stryCov_9fa48("46"), 'name'));

[Killed] StringLiteral
lib/rocketchat-client.js:52:31
 function validateChannelName(name) {
   assertNonEmptyString(name, 'name');
   if (name.length > MAX_CHANNEL_NAME_LENGTH) {
-    throw new ValidationError('channel name too long', 'name');
+    throw new ValidationError("", 'name');
   }
   if (!CHANNEL_NAME_PATTERN.test(name)) {
killedBy: validateChannelName rejects name exceeding MAX_CHANNEL_NAME_LENGTH
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /too long/
Received message: ""

      139 |       } else {
      140 |         stryCov_9fa48("44");
    > 141 |         throw new ValidationError(stryMutAct_9fa48("45") ? "" : (stryCov_9fa48("45"), 'channel name too long'), stryMutAct_9fa48("46") ? "" : (stryCov_9fa48("46"), 'name'));

[Killed] ConditionalExpression
lib/rocketchat-client.js:54:7
   if (name.length > MAX_CHANNEL_NAME_LENGTH) {
     throw new ValidationError('channel name too long', 'name');
   }
-  if (!CHANNEL_NAME_PATTERN.test(name)) {
+  if (false) {
     throw new ValidationError('channel name contains invalid characters', 'name');
   }
killedBy: validateChannelName rejects name with spaces
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /invalid characters/

Received function did not throw

[Killed] BlockStatement
lib/rocketchat-client.js:54:41
   if (name.length > MAX_CHANNEL_NAME_LENGTH) {
     throw new ValidationError('channel name too long', 'name');
   }
-  if (!CHANNEL_NAME_PATTERN.test(name)) {
-    throw new ValidationError('channel name contains invalid characters', 'name');
-  }
+  if (!CHANNEL_NAME_PATTERN.test(name)) {}
 }
 
killedBy: validateChannelName rejects name with spaces
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /invalid characters/

Received function did not throw

[Killed] StringLiteral
lib/rocketchat-client.js:55:31
     throw new ValidationError('channel name too long', 'name');
   }
   if (!CHANNEL_NAME_PATTERN.test(name)) {
-    throw new ValidationError('channel name contains invalid characters', 'name');
+    throw new ValidationError("", 'name');
   }
 }
killedBy: validateChannelName rejects name with spaces
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /invalid characters/
Received message: ""

      147 |       } else {
      148 |         stryCov_9fa48("50");
    > 149 |         throw new ValidationError(stryMutAct_9fa48("51") ? "" : (stryCov_9fa48("51"), 'channel name contains invalid characters'), stryMutAct_9fa48("52") ? "" : (stryCov_9fa48("52"), 'name'));

[Survived] StringLiteral
lib/rocketchat-client.js:55:75
     throw new ValidationError('channel name too long', 'name');
   }
   if (!CHANNEL_NAME_PATTERN.test(name)) {
-    throw new ValidationError('channel name contains invalid characters', 'name');
+    throw new ValidationError('channel name contains invalid characters', "");
   }
 }

[Killed] BlockStatement
lib/rocketchat-client.js:59:40
   }
 }
 
-function validateMessage(roomId, text) {
-  assertNonEmptyString(roomId, 'roomId');
-  if (typeof text !== 'string') {
-    throw new ValidationError('text must be a string', 'text');
-  }
-  if (text.length === 0) {
-    throw new ValidationError('text must not be empty', 'text');
-  }
-  if (text.length > MAX_MESSAGE_LENGTH) {
-    throw new ValidationError('text exceeds max length', 'text');
-  }
-}
+function validateMessage(roomId, text) {}
 
 function buildAuthHeaders(session) {
killedBy: validateMessage rejects empty roomId
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /roomId/

Received function did not throw

[Killed] ConditionalExpression
lib/rocketchat-client.js:61:7
 
 function validateMessage(roomId, text) {
   assertNonEmptyString(roomId, 'roomId');
-  if (typeof text !== 'string') {
+  if (true) {
     throw new ValidationError('text must be a string', 'text');
   }
killedBy: validateMessage accepts valid message
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "text must be a string"

      163 |       } else {
      164 |         stryCov_9fa48("59");
    > 165 |         throw new ValidationError(stryMutAct_9fa48("60") ? "" : (stryCov_9fa48("60"), 'text must be a string'), stryMutAct_9fa48("61") ? "" : (stryCov_9fa48("61"), 'text'));

[Killed] EqualityOperator
lib/rocketchat-client.js:61:7
 
 function validateMessage(roomId, text) {
   assertNonEmptyString(roomId, 'roomId');
-  if (typeof text !== 'string') {
+  if (typeof text === 'string') {
     throw new ValidationError('text must be a string', 'text');
   }
killedBy: validateMessage accepts valid message
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "text must be a string"

      163 |       } else {
      164 |         stryCov_9fa48("59");
    > 165 |         throw new ValidationError(stryMutAct_9fa48("60") ? "" : (stryCov_9fa48("60"), 'text must be a string'), stryMutAct_9fa48("61") ? "" : (stryCov_9fa48("61"), 'text'));

[Killed] ConditionalExpression
lib/rocketchat-client.js:64:7
   if (typeof text !== 'string') {
     throw new ValidationError('text must be a string', 'text');
   }
-  if (text.length === 0) {
+  if (true) {
     throw new ValidationError('text must not be empty', 'text');
   }
killedBy: validateMessage accepts valid message
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "text must not be empty"

      171 |       } else {
      172 |         stryCov_9fa48("65");
    > 173 |         throw new ValidationError(stryMutAct_9fa48("66") ? "" : (stryCov_9fa48("66"), 'text must not be empty'), stryMutAct_9fa48("67") ? "" : (stryCov_9fa48("67"), 'text'));

[Killed] ConditionalExpression
lib/rocketchat-client.js:64:7
   if (typeof text !== 'string') {
     throw new ValidationError('text must be a string', 'text');
   }
-  if (text.length === 0) {
+  if (false) {
     throw new ValidationError('text must not be empty', 'text');
   }
killedBy: validateMessage rejects empty message text
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /text must not be empty/

Received function did not throw

[Survived] StringLiteral
lib/rocketchat-client.js:65:57
     throw new ValidationError('text must be a string', 'text');
   }
   if (text.length === 0) {
-    throw new ValidationError('text must not be empty', 'text');
+    throw new ValidationError('text must not be empty', "");
   }
   if (text.length > MAX_MESSAGE_LENGTH) {

[Killed] BlockStatement
lib/rocketchat-client.js:67:41
   if (text.length === 0) {
     throw new ValidationError('text must not be empty', 'text');
   }
-  if (text.length > MAX_MESSAGE_LENGTH) {
-    throw new ValidationError('text exceeds max length', 'text');
-  }
+  if (text.length > MAX_MESSAGE_LENGTH) {}
 }
 
killedBy: validateMessage rejects message exceeding MAX_MESSAGE_LENGTH
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /exceeds max length/

Received function did not throw

[Killed] EqualityOperator
lib/rocketchat-client.js:67:7
   if (text.length === 0) {
     throw new ValidationError('text must not be empty', 'text');
   }
-  if (text.length > MAX_MESSAGE_LENGTH) {
+  if (text.length <= MAX_MESSAGE_LENGTH) {
     throw new ValidationError('text exceeds max length', 'text');
   }
killedBy: validateMessage accepts valid message
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "text exceeds max length"

      179 |       } else {
      180 |         stryCov_9fa48("72");
    > 181 |         throw new ValidationError(stryMutAct_9fa48("73") ? "" : (stryCov_9fa48("73"), 'text exceeds max length'), stryMutAct_9fa48("74") ? "" : (stryCov_9fa48("74"), 'text'));

[Killed] StringLiteral
lib/rocketchat-client.js:68:31
     throw new ValidationError('text must not be empty', 'text');
   }
   if (text.length > MAX_MESSAGE_LENGTH) {
-    throw new ValidationError('text exceeds max length', 'text');
+    throw new ValidationError("", 'text');
   }
 }
killedBy: validateMessage rejects message exceeding MAX_MESSAGE_LENGTH
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /exceeds max length/
Received message: ""

      179 |       } else {
      180 |         stryCov_9fa48("72");
    > 181 |         throw new ValidationError(stryMutAct_9fa48("73") ? "" : (stryCov_9fa48("73"), 'text exceeds max length'), stryMutAct_9fa48("74") ? "" : (stryCov_9fa48("74"), 'text'));

[Survived] StringLiteral
lib/rocketchat-client.js:68:58
     throw new ValidationError('text must not be empty', 'text');
   }
   if (text.length > MAX_MESSAGE_LENGTH) {
-    throw new ValidationError('text exceeds max length', 'text');
+    throw new ValidationError('text exceeds max length', "");
   }
 }

[Killed] BlockStatement
lib/rocketchat-client.js:72:36
   }
 }
 
-function buildAuthHeaders(session) {
-  if (!session || !session.userId || !session.authToken) {
-    throw new ValidationError('missing session', 'session');
-  }
-  return {
-    'X-Auth-Token': session.authToken,
-    'X-User-Id': session.userId,
-  };
-}
+function buildAuthHeaders(session) {}
 
 function isRetryableStatus(status) {
killedBy: buildAuthHeaders returns X-Auth-Token and X-User-Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"X-Auth-Token": "t1", "X-User-Id": "u1"}
Received: undefined

[Killed] LogicalOperator
lib/rocketchat-client.js:73:7
 }
 
 function buildAuthHeaders(session) {
-  if (!session || !session.userId || !session.authToken) {
+  if ((!session || !session.userId) && !session.authToken) {
     throw new ValidationError('missing session', 'session');
   }
killedBy: buildAuthHeaders throws when session is null
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'authToken')"

      189 |   } else {

[Killed] BlockStatement
lib/rocketchat-client.js:73:58
 }
 
 function buildAuthHeaders(session) {
-  if (!session || !session.userId || !session.authToken) {
-    throw new ValidationError('missing session', 'session');
-  }
+  if (!session || !session.userId || !session.authToken) {}
   return {
     'X-Auth-Token': session.authToken,
killedBy: buildAuthHeaders throws when session is null
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'authToken')"

      198 |     }

[Killed] StringLiteral
lib/rocketchat-client.js:74:31
 
 function buildAuthHeaders(session) {
   if (!session || !session.userId || !session.authToken) {
-    throw new ValidationError('missing session', 'session');
+    throw new ValidationError("", 'session');
   }
   return {
killedBy: buildAuthHeaders throws when authToken missing
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /missing session/
Received message: ""

      194 |       } else {
      195 |         stryCov_9fa48("84");
    > 196 |         throw new ValidationError(stryMutAct_9fa48("85") ? "" : (stryCov_9fa48("85"), 'missing session'), stryMutAct_9fa48("86") ? "" : (stryCov_9fa48("86"), 'session'));

[Killed] BlockStatement
lib/rocketchat-client.js:82:36
   };
 }
 
-function isRetryableStatus(status) {
-  return status === 429 || (status >= 500 && status < 600);
-}
+function isRetryableStatus(status) {}
 
 async function withRetry(fn, { retries = 2, delayMs = 100 } = {}) {
killedBy: isRetryableStatus 429 is retryable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
lib/rocketchat-client.js:83:29
 }
 
 function isRetryableStatus(status) {
-  return status === 429 || (status >= 500 && status < 600);
+  return status === 429 || (status >= 500 || status < 600);
 }
 
killedBy: isRetryableStatus 200 is not retryable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
lib/rocketchat-client.js:83:29
 }
 
 function isRetryableStatus(status) {
-  return status === 429 || (status >= 500 && status < 600);
+  return status === 429 || (status > 500 && status < 600);
 }
 
killedBy: isRetryableStatus 500 is retryable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
lib/rocketchat-client.js:86:67
   return status === 429 || (status >= 500 && status < 600);
 }
 
-async function withRetry(fn, { retries = 2, delayMs = 100 } = {}) {
-  let lastError;
-  for (let attempt = 0; attempt <= retries; attempt += 1) {
-    try {
-      return await fn();
-    } catch (error) {
-      lastError = error;
-      const status = error.response && error.response.status;
-      if (!isRetryableStatus(status) || attempt === retries) {
-        throw error;
-      }
-      await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt + 1)));
-    }
-  }
-  throw lastError;
-}
+async function withRetry(fn, { retries = 2, delayMs = 100 } = {}) {}
 
 function normalizeError(error) {
killedBy: withRetry returns value on first success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ok"
Received: undefined

[Killed] ConditionalExpression
lib/rocketchat-client.js:88:25
 
 async function withRetry(fn, { retries = 2, delayMs = 100 } = {}) {
   let lastError;
-  for (let attempt = 0; attempt <= retries; attempt += 1) {
+  for (let attempt = 0; false; attempt += 1) {
     try {
       return await fn();
killedBy: withRetry returns value on first success
statusReason: Error: thrown: undefined

[Killed] BlockStatement
lib/rocketchat-client.js:88:59
 
 async function withRetry(fn, { retries = 2, delayMs = 100 } = {}) {
   let lastError;
-  for (let attempt = 0; attempt <= retries; attempt += 1) {
-    try {
-      return await fn();
-    } catch (error) {
-      lastError = error;
-      const status = error.response && error.response.status;
-      if (!isRetryableStatus(status) || attempt === retries) {
-        throw error;
-      }
-      await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt + 1)));
-    }
-  }
+  for (let attempt = 0; attempt <= retries; attempt += 1) {}
   throw lastError;
 }
killedBy: withRetry returns value on first success
statusReason: Error: thrown: undefined

[Killed] BlockStatement
lib/rocketchat-client.js:89:9
 async function withRetry(fn, { retries = 2, delayMs = 100 } = {}) {
   let lastError;
   for (let attempt = 0; attempt <= retries; attempt += 1) {
-    try {
-      return await fn();
-    } catch (error) {
+    try {} catch (error) {
       lastError = error;
       const status = error.response && error.response.status;
killedBy: withRetry returns value on first success
statusReason: Error: thrown: undefined

[Killed] BlockStatement
lib/rocketchat-client.js:91:21
   for (let attempt = 0; attempt <= retries; attempt += 1) {
     try {
       return await fn();
-    } catch (error) {
-      lastError = error;
-      const status = error.response && error.response.status;
-      if (!isRetryableStatus(status) || attempt === retries) {
-        throw error;
-      }
-      await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt + 1)));
-    }
+    } catch (error) {}
   }
   throw lastError;
killedBy: withRetry does not retry on 400
statusReason: Error: expect(received).rejects.toBeDefined()

Received: undefined

[Killed] ConditionalExpression
lib/rocketchat-client.js:93:22
       return await fn();
     } catch (error) {
       lastError = error;
-      const status = error.response && error.response.status;
+      const status = true;
       if (!isRetryableStatus(status) || attempt === retries) {
         throw error;
killedBy: withRetry retries on 503 and eventually succeeds
statusReason: Error: thrown: Object {
  "response": Object {
    "status": 503,
  },
}

[Killed] ConditionalExpression
lib/rocketchat-client.js:93:22
       return await fn();
     } catch (error) {
       lastError = error;
-      const status = error.response && error.response.status;
+      const status = false;
       if (!isRetryableStatus(status) || attempt === retries) {
         throw error;
killedBy: withRetry retries on 503 and eventually succeeds
statusReason: Error: thrown: Object {
  "response": Object {
    "status": 503,
  },
}

[Killed] EqualityOperator
lib/rocketchat-client.js:94:41
     } catch (error) {
       lastError = error;
       const status = error.response && error.response.status;
-      if (!isRetryableStatus(status) || attempt === retries) {
+      if (!isRetryableStatus(status) || attempt !== retries) {
         throw error;
       }
killedBy: withRetry retries on 503 and eventually succeeds
statusReason: Error: thrown: Object {
  "response": Object {
    "status": 503,
  },
}

[Killed] BooleanLiteral
lib/rocketchat-client.js:94:11
     } catch (error) {
       lastError = error;
       const status = error.response && error.response.status;
-      if (!isRetryableStatus(status) || attempt === retries) {
+      if (isRetryableStatus(status) || attempt === retries) {
         throw error;
       }
killedBy: withRetry retries on 503 and eventually succeeds
statusReason: Error: thrown: Object {
  "response": Object {
    "status": 503,
  },
}

[Killed] ArrowFunction
lib/rocketchat-client.js:97:25
       if (!isRetryableStatus(status) || attempt === retries) {
         throw error;
       }
-      await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt + 1)));
+      await new Promise(() => undefined);
     }
   }
killedBy: withRetry retries on 503 and eventually succeeds
statusReason: Error: thrown: "Exceeded timeout of 15000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ArithmeticOperator
lib/rocketchat-client.js:97:69
       if (!isRetryableStatus(status) || attempt === retries) {
         throw error;
       }
-      await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt + 1)));
+      await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt - 1)));
     }
   }

[Killed] BlockStatement
lib/rocketchat-client.js:103:32
   throw lastError;
 }
 
-function normalizeError(error) {
-  if (error.response) {
-    const { status, data } = error.response;
-    return new ApiError(
-      (data && data.error) || error.message,
-      status,
-      data,
-    );
-  }
-  return error;
-}
+function normalizeError(error) {}
 
 class RocketChatClient {
killedBy: normalizeError wraps axios error with response into ApiError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ApiError

Received value has no prototype
Received value: undefined

[Killed] ConditionalExpression
lib/rocketchat-client.js:104:7
 }
 
 function normalizeError(error) {
-  if (error.response) {
+  if (true) {
     const { status, data } = error.response;
     return new ApiError(
killedBy: normalizeError returns the original error when response absent
statusReason: TypeError: Cannot destructure property 'status' of 'error.response' as it is undefined.

[Killed] ConditionalExpression
lib/rocketchat-client.js:104:7
 }
 
 function normalizeError(error) {
-  if (error.response) {
+  if (false) {
     const { status, data } = error.response;
     return new ApiError(
killedBy: normalizeError wraps axios error with response into ApiError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ApiError
Received constructor: Object

[Killed] LogicalOperator
lib/rocketchat-client.js:107:8
   if (error.response) {
     const { status, data } = error.response;
     return new ApiError(
-      (data && data.error) || error.message,
+      (data || data.error) || error.message,
       status,
       data,
killedBy: normalizeError wraps axios error with response into ApiError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unauthorized"
Received: "[object Object]"
