[Killed] ConditionalExpression
lib/rocketchat-client.js:107:7
   if (error.response) {
     const { status, data } = error.response;
     return new ApiError(
-      (data && data.error) || error.message,
+      false,
       status,
       data,
killedBy: normalizeError wraps axios error with response into ApiError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unauthorized"
Received: "false"

[Killed] BlockStatement
lib/rocketchat-client.js:116:64
 }
 
 class RocketChatClient {
-  constructor({ baseUrl = DEFAULT_BASE_URL, httpClient } = {}) {
-    this.baseUrl = baseUrl.replace(/\/+$/, '');
-    this.http = httpClient || axios.create({ baseURL: this.baseUrl, timeout: 10000 });
-    this.session = null;
-  }
+  constructor({ baseUrl = DEFAULT_BASE_URL, httpClient } = {}) {}
 
   async login(username, password) {
killedBy: RocketChatClient.login stores session on successful login
statusReason: TypeError: Cannot read properties of undefined (reading 'post')

[Survived] StringLiteral
lib/rocketchat-client.js:117:44
 
 class RocketChatClient {
   constructor({ baseUrl = DEFAULT_BASE_URL, httpClient } = {}) {
-    this.baseUrl = baseUrl.replace(/\/+$/, '');
+    this.baseUrl = baseUrl.replace(/\/+$/, "Stryker was here!");
     this.http = httpClient || axios.create({ baseURL: this.baseUrl, timeout: 10000 });
     this.session = null;

[Killed] ConditionalExpression
lib/rocketchat-client.js:118:17
 class RocketChatClient {
   constructor({ baseUrl = DEFAULT_BASE_URL, httpClient } = {}) {
     this.baseUrl = baseUrl.replace(/\/+$/, '');
-    this.http = httpClient || axios.create({ baseURL: this.baseUrl, timeout: 10000 });
+    this.http = false;
     this.session = null;
   }
killedBy: RocketChatClient.login stores session on successful login
statusReason: TypeError: this.http.post is not a function

[Killed] LogicalOperator
lib/rocketchat-client.js:118:17
 class RocketChatClient {
   constructor({ baseUrl = DEFAULT_BASE_URL, httpClient } = {}) {
     this.baseUrl = baseUrl.replace(/\/+$/, '');
-    this.http = httpClient || axios.create({ baseURL: this.baseUrl, timeout: 10000 });
+    this.http = httpClient && axios.create({
+  baseURL: this.baseUrl,
+  timeout: 10000
+});
     this.session = null;
   }
killedBy: RocketChatClient.login stores session on successful login
statusReason: ApiError: Unauthorized

[Killed] BlockStatement
lib/rocketchat-client.js:122:35
     this.session = null;
   }
 
-  async login(username, password) {
-    validateCredentials(username, password);
-    try {
-      const response = await withRetry(() =>
-        this.http.post('/api/v1/login', { user: username, password }),
-      );
-      const { data } = response;
-      if (!data || data.status !== 'success' || !data.data) {
-        throw new ApiError('unexpected login response', response.status, data);
-      }
-      this.session = {
-        userId: data.data.userId,
-        authToken: data.data.authToken,
-      };
-      return this.session;
-    } catch (error) {
-      throw normalizeError(error);
-    }
-  }
+  async login(username, password) {}
 
   async logout() {
killedBy: RocketChatClient.login stores session on successful login
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"authToken": "t1", "userId": "u1"}
Received: undefined

[Killed] BlockStatement
lib/rocketchat-client.js:124:9
 
   async login(username, password) {
     validateCredentials(username, password);
-    try {
-      const response = await withRetry(() =>
-        this.http.post('/api/v1/login', { user: username, password }),
-      );
-      const { data } = response;
-      if (!data || data.status !== 'success' || !data.data) {
-        throw new ApiError('unexpected login response', response.status, data);
-      }
-      this.session = {
-        userId: data.data.userId,
-        authToken: data.data.authToken,
-      };
-      return this.session;
-    } catch (error) {
+    try {} catch (error) {
       throw normalizeError(error);
     }
killedBy: RocketChatClient.login stores session on successful login
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"authToken": "t1", "userId": "u1"}
Received: undefined

[Killed] ArrowFunction
lib/rocketchat-client.js:125:40
   async login(username, password) {
     validateCredentials(username, password);
     try {
-      const response = await withRetry(() =>
-        this.http.post('/api/v1/login', { user: username, password }),
+      const response = await withRetry(() => undefined,
       );
       const { data } = response;
killedBy: RocketChatClient.login stores session on successful login
statusReason: TypeError: Cannot destructure property 'data' of 'response' as it is undefined.

[Killed] StringLiteral
lib/rocketchat-client.js:126:24
     validateCredentials(username, password);
     try {
       const response = await withRetry(() =>
-        this.http.post('/api/v1/login', { user: username, password }),
+        this.http.post("", { user: username, password }),
       );
       const { data } = response;
killedBy: RocketChatClient.login stores session on successful login
statusReason: ApiError: no handler

[Survived] ObjectLiteral
lib/rocketchat-client.js:126:41
     validateCredentials(username, password);
     try {
       const response = await withRetry(() =>
-        this.http.post('/api/v1/login', { user: username, password }),
+        this.http.post('/api/v1/login', {}),
       );
       const { data } = response;

[Killed] EqualityOperator
lib/rocketchat-client.js:129:20
         this.http.post('/api/v1/login', { user: username, password }),
       );
       const { data } = response;
-      if (!data || data.status !== 'success' || !data.data) {
+      if (!data || data.status === 'success' || !data.data) {
         throw new ApiError('unexpected login response', response.status, data);
       }
killedBy: RocketChatClient.login stores session on successful login
statusReason: ApiError: unexpected login response

[Killed] ConditionalExpression
lib/rocketchat-client.js:129:11
         this.http.post('/api/v1/login', { user: username, password }),
       );
       const { data } = response;
-      if (!data || data.status !== 'success' || !data.data) {
+      if (true) {
         throw new ApiError('unexpected login response', response.status, data);
       }
killedBy: RocketChatClient.login stores session on successful login
statusReason: ApiError: unexpected login response

[Killed] BlockStatement
lib/rocketchat-client.js:137:21
         authToken: data.data.authToken,
       };
       return this.session;
-    } catch (error) {
-      throw normalizeError(error);
-    }
+    } catch (error) {}
   }
 
killedBy: RocketChatClient.login throws ApiError on 401
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
lib/rocketchat-client.js:142:18
     }
   }
 
-  async logout() {
-    if (!this.session) {
-      return { ok: true, alreadyLoggedOut: true };
-    }
-    const headers = buildAuthHeaders(this.session);
-    try {
-      await this.http.post('/api/v1/logout', {}, { headers });
-      this.session = null;
-      return { ok: true, alreadyLoggedOut: false };
-    } catch (error) {
-      throw normalizeError(error);
-    }
-  }
+  async logout() {}
 
   async createChannel(name) {
killedBy: RocketChatClient.logout clears session on successful logout
statusReason: TypeError: Cannot read properties of undefined (reading 'alreadyLoggedOut')

[Killed] ConditionalExpression
lib/rocketchat-client.js:143:9
   }
 
   async logout() {
-    if (!this.session) {
+    if (true) {
       return { ok: true, alreadyLoggedOut: true };
     }
killedBy: RocketChatClient.logout clears session on successful logout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
lib/rocketchat-client.js:143:9
   }
 
   async logout() {
-    if (!this.session) {
+    if (false) {
       return { ok: true, alreadyLoggedOut: true };
     }
killedBy: RocketChatClient.logout no-op when not logged in
statusReason: ValidationError: missing session

[Killed] BooleanLiteral
lib/rocketchat-client.js:144:20
 
   async logout() {
     if (!this.session) {
-      return { ok: true, alreadyLoggedOut: true };
+      return { ok: false, alreadyLoggedOut: true };
     }
     const headers = buildAuthHeaders(this.session);
killedBy: RocketChatClient.logout no-op when not logged in
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "alreadyLoggedOut": true,
-   "ok": true,

[Killed] BooleanLiteral
lib/rocketchat-client.js:144:44
 
   async logout() {
     if (!this.session) {
-      return { ok: true, alreadyLoggedOut: true };
+      return { ok: true, alreadyLoggedOut: false };
     }
     const headers = buildAuthHeaders(this.session);
killedBy: RocketChatClient.logout no-op when not logged in
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "alreadyLoggedOut": true,
+   "alreadyLoggedOut": false,

[Killed] BlockStatement
lib/rocketchat-client.js:147:9
       return { ok: true, alreadyLoggedOut: true };
     }
     const headers = buildAuthHeaders(this.session);
-    try {
-      await this.http.post('/api/v1/logout', {}, { headers });
-      this.session = null;
-      return { ok: true, alreadyLoggedOut: false };
-    } catch (error) {
+    try {} catch (error) {
       throw normalizeError(error);
     }
killedBy: RocketChatClient.logout clears session on successful logout
statusReason: TypeError: Cannot read properties of undefined (reading 'alreadyLoggedOut')

[Survived] ObjectLiteral
lib/rocketchat-client.js:148:50
     }
     const headers = buildAuthHeaders(this.session);
     try {
-      await this.http.post('/api/v1/logout', {}, { headers });
+      await this.http.post('/api/v1/logout', {}, {});
       this.session = null;
       return { ok: true, alreadyLoggedOut: false };

[Killed] BooleanLiteral
lib/rocketchat-client.js:150:44
     try {
       await this.http.post('/api/v1/logout', {}, { headers });
       this.session = null;
-      return { ok: true, alreadyLoggedOut: false };
+      return { ok: true, alreadyLoggedOut: true };
     } catch (error) {
       throw normalizeError(error);
killedBy: RocketChatClient.logout clears session on successful logout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BooleanLiteral
lib/rocketchat-client.js:150:20
     try {
       await this.http.post('/api/v1/logout', {}, { headers });
       this.session = null;
-      return { ok: true, alreadyLoggedOut: false };
+      return { ok: false, alreadyLoggedOut: false };
     } catch (error) {
       throw normalizeError(error);

[NoCoverage] BlockStatement
lib/rocketchat-client.js:151:21
       await this.http.post('/api/v1/logout', {}, { headers });
       this.session = null;
       return { ok: true, alreadyLoggedOut: false };
-    } catch (error) {
-      throw normalizeError(error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
lib/rocketchat-client.js:156:29
     }
   }
 
-  async createChannel(name) {
-    validateChannelName(name);
-    const headers = buildAuthHeaders(this.session);
-    try {
-      const response = await this.http.post(
-        '/api/v1/channels.create',
-        { name },
-        { headers },
-      );
-      return response.data.channel;
-    } catch (error) {
-      throw normalizeError(error);
-    }
-  }
+  async createChannel(name) {}
 
   async sendMessage(roomId, text) {
killedBy: RocketChatClient.createChannel sends auth headers and returns channel
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"_id": "r1", "name": "my-chan"}
Received: undefined

[Killed] BlockStatement
lib/rocketchat-client.js:159:9
   async createChannel(name) {
     validateChannelName(name);
     const headers = buildAuthHeaders(this.session);
-    try {
-      const response = await this.http.post(
-        '/api/v1/channels.create',
-        { name },
-        { headers },
-      );
-      return response.data.channel;
-    } catch (error) {
+    try {} catch (error) {
       throw normalizeError(error);
     }
killedBy: RocketChatClient.createChannel sends auth headers and returns channel
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"_id": "r1", "name": "my-chan"}
Received: undefined

[Killed] StringLiteral
lib/rocketchat-client.js:161:9
     const headers = buildAuthHeaders(this.session);
     try {
       const response = await this.http.post(
-        '/api/v1/channels.create',
+        "",
         { name },
         { headers },
killedBy: RocketChatClient.createChannel sends auth headers and returns channel
statusReason: ApiError: no handler

[NoCoverage] BlockStatement
lib/rocketchat-client.js:166:21
         { headers },
       );
       return response.data.channel;
-    } catch (error) {
-      throw normalizeError(error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
lib/rocketchat-client.js:171:35
     }
   }
 
-  async sendMessage(roomId, text) {
-    validateMessage(roomId, text);
-    const headers = buildAuthHeaders(this.session);
-    try {
-      const response = await withRetry(() =>
-        this.http.post(
-          '/api/v1/chat.sendMessage',
-          { message: { rid: roomId, msg: text } },
-          { headers },
-        ),
-      );
-      return response.data.message;
-    } catch (error) {
-      throw normalizeError(error);
-    }
-  }
+  async sendMessage(roomId, text) {}
 
   isAuthenticated() {
killedBy: RocketChatClient.sendMessage sends message and returns stored record
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"_id": "m1", "msg": "hello", "rid": "ROOM1"}
Received: undefined

[Killed] BlockStatement
lib/rocketchat-client.js:174:9
   async sendMessage(roomId, text) {
     validateMessage(roomId, text);
     const headers = buildAuthHeaders(this.session);
-    try {
-      const response = await withRetry(() =>
-        this.http.post(
-          '/api/v1/chat.sendMessage',
-          { message: { rid: roomId, msg: text } },
-          { headers },
-        ),
-      );
-      return response.data.message;
-    } catch (error) {
+    try {} catch (error) {
       throw normalizeError(error);
     }
killedBy: RocketChatClient.sendMessage sends message and returns stored record
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"_id": "m1", "msg": "hello", "rid": "ROOM1"}
Received: undefined

[Killed] ArrowFunction
lib/rocketchat-client.js:175:40
     validateMessage(roomId, text);
     const headers = buildAuthHeaders(this.session);
     try {
-      const response = await withRetry(() =>
-        this.http.post(
-          '/api/v1/chat.sendMessage',
-          { message: { rid: roomId, msg: text } },
-          { headers },
-        ),
+      const response = await withRetry(() => undefined,
       );
       return response.data.message;
killedBy: RocketChatClient.sendMessage sends message and returns stored record
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] ObjectLiteral
lib/rocketchat-client.js:178:22
       const response = await withRetry(() =>
         this.http.post(
           '/api/v1/chat.sendMessage',
-          { message: { rid: roomId, msg: text } },
+          { message: {} },
           { headers },
         ),
killedBy: RocketChatClient.sendMessage sends message and returns stored record
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "_id": "m1",
-   "msg": "hello",

[NoCoverage] BlockStatement
lib/rocketchat-client.js:183:21
         ),
       );
       return response.data.message;
-    } catch (error) {
-      throw normalizeError(error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
lib/rocketchat-client.js:188:21
     }
   }
 
-  isAuthenticated() {
-    return Boolean(this.session && this.session.authToken && this.session.userId);
-  }
+  isAuthenticated() {}
 }
 
killedBy: RocketChatClient.login stores session on successful login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
lib/rocketchat-client.js:189:20
   }
 
   isAuthenticated() {
-    return Boolean(this.session && this.session.authToken && this.session.userId);
+    return Boolean(false);
   }
 }
killedBy: RocketChatClient.login stores session on successful login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
lib/rocketchat-client.js:189:20
   }
 
   isAuthenticated() {
-    return Boolean(this.session && this.session.authToken && this.session.userId);
+    return Boolean(this.session || this.session.authToken && this.session.userId);
   }
 }
killedBy: RocketChatClient.login throws ApiError on 401
statusReason: TypeError: Cannot read properties of null (reading 'authToken')
